{"_id":{"$oid":"63f80f71a5c363de85e0b7c7"},"title":"The Shawshank Redemption","description":"A banker convicted of murdering his wife learns how to cope with life in prison.","genre":{"name":"Drama","description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"director":{"name":"Frank Darabont","bio":"Three-time Oscar nominee Frank Darabont was born in a refugee camp in Montbeliard, France, the son of Hungarian parents who had fled Budapest during the failed 1956 Hungarian revolution. Brought to America as an infant, he settled with his family in Los Angeles and attended Hollywood High School. Darabont is one of only six filmmakers in history with the unique distinction of having his first two feature films receive nominations for the Best Picture Academy Award: 1994's The Shawshank Redemption (1994) (with a total of seven nominations) and 1999's The Green Mile (1999) (four nominations). Darabont himself collected Oscar nominations for Best Adapted Screenplay for each film (both based on works by Stephen King).","birth":"1959"},"imagePath":"theshawshankredemption.png","featured":true}
{"_id":{"$oid":"63f81ac2a5c363de85e0b7c8"},"title":"Braveheart","description":"A Scottish rebel seeks vengence and independance from England after his wife is killed.","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"director":{"name":"Mel Gibson","bio":"Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York. Mel and his family moved to Australia in the late 1960s, settling in New South Wales. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in the film Mad Max, mkaing him known worldwide. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played 'Martin Riggs'. 1995 brought his most famous role as 'Sir William Wallace' in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999).","birth":"1956"},"imagePath":"braveheart.png","featured":true}
{"_id":{"$oid":"63f81d3fa5c363de85e0b7c9"},"title":"Saving Private Ryan","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"director":{"name":"Steven Spielberg","bio":"He is the GOAT.","birth":"1946"},"imagePath":"savingprivateryan.png","featured":false,"description":"A group of soldiers in WWII is tasked with finding and sending home a Private whose three brothers were all killed on D-Day."}
{"_id":{"$oid":"63f81e21a5c363de85e0b7ca"},"title":"The Departed","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"director":{"name":"Martin Scorcese","bio":"Martin Charles Scorsese was born in Queens, New York City, and was raised in the neighborhood of Little Italy, which became an inspiration for many of his films. Despite being the most Oscar-nominated living director (Raging Bull, The Last Temptation of Christ, Goodfellas, The Age of Innocence, Gangs of New York, The Aviator, Hugo, The Wolf of Wall Street, The Irishman), only The Departed saw him taking home the trophy.","birth":"1942"},"imagePath":"thedeparted.png","featured":false,"description":"A story set in Boston pitting the police against the Irish mob, both whom attempt to infiltrate the other with undercover agents."}
{"_id":{"$oid":"63f81f22a5c363de85e0b7cb"},"title":"Memento","genre":{"name":"Drama","description":"A thriller is a type of mystery with a few key differences. As its name suggests, thrillers tend to be action-packed and fast-paced with moments full of tension, anxiety, and fear. Without fail, they are plot-driven stories."},"director":{"name":"Christopher Nolan","bio":"Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970, in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made. Most notable works are Memento, Insomnia, Inception, Interstellar, Tenet, and is probably best known for the most recent Batman trilogy.","birth":"1970"},"imagePath":"memento.png","featured":false,"description":"A man seeks vengeance for the murder of his wife, hindered by the fact that he has lost his ability to create long-term memories."}
{"_id":{"$oid":"63f82555a5c363de85e0b7cc"},"title":"Aliens","genre":{"name":"Thriller","description":"A thriller is a type of mystery with a few key differences. As its name suggests, thrillers tend to be action-packed and fast-paced with moments full of tension, anxiety, and fear. Without fail, they are plot-driven stories."},"director":{"name":"James Cameron","bio":"James Francis Cameron was born in Kapuskasing, Ontario, Canada. After two different majors, he dropped out of college and drove trucks t support his filmmaking ambition. His big break came when he wrote and directed The Terminator, which was a low budget success and kickstarted the career of Arnold Schwarzeneggar and had several sequels. He then made more science fiction thrillers in Aliens and The Abyss. He became a household name with the making of Titanic, which was the highest grossing movie in history for 12 years until he beat his own record with Avatar.","birth":"1954"},"imagePath":"aliens.png","featured":false,"description":"The sequel to Alien, Ripley now faces off against an army of xenomorph aliens with a military squadron in an attempt to rescue settlers on a new planet."}
{"_id":{"$oid":"63f82656a5c363de85e0b7cd"},"title":"Toy Story","genre":{"name":"Animated","description":"Animation is the art of putting a series of pictures together to give the appearance of motion."},"director":{"name":"John Lasseter","bio":"Although born in Hollywood, John and his twin sister Johanna were raised in Whittier near Los Angeles. It was when he was in High School that he realized that he could have a career in animation and he wrote to the Walt Disney Studios but nothing happened. He then attended Calarts' new animation school and was hired at Disney upon graduation. He later became interested in computer animation and began making a film with a friend outside of his work with Disney, which got him fired. He kept touting that computer animation was the future and got the funding to create what would become Pixar Animation, ironically later bought by Disney.","birth":"1957"},"imagePath":"toystory.png","featured":false,"description":"A child's toys come to life when humans aren't around. Hijinx ensue when a new toy who thinks he's actually a space ranger joins the group."}
{"_id":{"$oid":"63f828a1a5c363de85e0b7ce"},"title":"Avengers: Endgame","genre":{"name":"Action","description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots."},"director":{"name":"The Russo Brothers","bio":"Anthony J. Russo and Joseph Russo are an American filmmaking and producing duo. They have directed You, Me and Dupree, Cherry and the Marvel films Captain America: The Winter Soldier, Captain America: Civil War, Avengers: Infinity War and Avengers: Endgame. Endgame is one of the highest grossing films of all time.","birth":"1970"},"imagePath":"avengersendgame.png","featured":false,"description":"The Avengers team up once again in an attempt to make things right from their previous loss against Thanos, a mass murdering alien bent on destruction."}
{"_id":{"$oid":"63f8f2d1a5c363de85e0b7cf"},"title":"Good Will Hunting","genre":{"name":"Drama","description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"director":{"name":"Gus Van Sant","bio":"Gus Green Van Sant Jr. is an American filmmaker, painter, screenwriter, photographer and musician from Louisville, Kentucky who is known for directing films such as Good Will Hunting, the 1998 remake of Psycho, Gerry, Elephant, My Own Private Idaho, To Die For, Milk, Last Days, Finding Forrester, Promised Land, Drugstore Cowboy and Mala Noche.","birth":"1952"},"imagePath":"goodwillhunting.png","featured":false,"description":"A troubled young man from the wrong side of the tracks is a secret genius who makes a deal to stay out of jail, agreeing to work with an MIT professor and go to therapy."}
{"_id":{"$oid":"63f8f3b6a5c363de85e0b7d0"},"title":"Jurassic Park","genre":{"name":"Thriller","description":"A thriller is a type of mystery with a few key differences. As its name suggests, thrillers tend to be action-packed and fast-paced with moments full of tension, anxiety, and fear. Without fail, they are plot-driven stories."},"director":{"name":"Steven Spielberg","bio":"He is the GOAT.","birth":"1946"},"imagePath":"jurassicpark.png","featured":true,"description":"Dinosaurs eat people."}
